/**
 * 用於偵測粗魯言詞的關鍵詞。
 * @type {string[]}
 */
// @remove-duplicates
export const rude_words = [
	'傻逼', '白痴', '蠢货', '弱智', '傻子', '废物', '下贱', '低能', '无能', '死妈', '恶心', '不知死活', '活得不耐烦',
	'骂人', '人身攻击', '歧视', '侮辱', '生气', '呃呃', '阴阳怪气', '死',
	'禁言', '踢了', '飞了', '杀了', '丧家之犬', '蠢逼',
	'没爹', '没母', '没父', '没人养', '你是猪'
]

/**
 * 日式顏文字清單。
 * @type {string[]}
 */
// @remove-duplicates
export const Kaomoji_list = [
	'(*´▽｀*)ヾ', '(＃￣ω￣)', '(￣▽￣)ノ',
	'(⊙ω⊙)', '(｡•̀ᴗ-)✧', '(*/ω＼*)',
	'(｀・ω・´)', '(￣▽￣)', '(*°∀°)=3',
	'ヾ(^▽^*)', '(*´▽`*)', '(≧▽≦)',
	'(⁄ ⁄•⁄ω⁄•⁄ ⁄)', '(｡♥‿♥｡)', '(￣︶￣)',
	'(๑•̀ㅂ•́)و ', '(╯°□°)╯', '(≧∇≦)/',
	'⊙ω⊙', '(*≧ω≦)', '(*≧▽≦)ノ',
	'(〃￣︶￣〃)', '（*´▽｀*）', '(っ´ω`)っ',
	'( ̩̩̩(˃̣̣̥A˂̣̣̥ )', '(´∀`)', '(´・ω・`)',
	'(´∩ω∩`)', '(´；ω；`)', '(´∀`*)',
	'(´∩｡• ᵕ •｡∩`)', '(´ꓳ`)', '(´｡• ω •｡`)',
	'(´-ω-`)', '(´,,•ω•,,`)', '(๑´ω`๑)',
	'`ω`', '( ´ ω ` )', '(・ω・)',
	'(* ´ ω ` *)', '(o´ω`o)', 'ヽ( ´ ω ` )ﾉ',
	'(ﾉ´ ω `)ﾉ', '(っ´ω`c)', '(´ω` )/',
	'(ゝω・)☆', '( >ω< )', '┐(´ω`)┌',
	'( • ̀ω•́ )✧', '|ω・)', '|ω・)ﾉ',
	'(*ﾉωﾉ)', '(//´/ω/`//)', '( ; ´ ω ` )',
	'(・ω・｀)？', '(・ω・`三`・ω・)', '(`・`ω´・´)',
	'(^・ω・^)', '(=´ω`=)', 'າ(’ω’າ)'
]

/**
 * 從文字移除預定義顏文字。
 * @param {string} text 原始文字。
 * @returns {string} 移除後的文字。
 */
export function remove_kaomoji(text) {
	for (const kaomoji of Kaomoji_list)
		text = text.replaceAll(kaomoji, '')
	return text
}
